In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("data.csv")

In [3]:
df

  Name  Roll Branch
0  aaa   111    cse
1   bb    22     it
2   cc    12    ece

In [5]:
list=['akd','akdsc','akdlive','unacademy']
df1=pd.DataFrame(list)
print(df1)

           0
0        akd
1      akdsc
2    akdlive
3  unacademy

In [6]:
data={'Name':['arun','pankaj','aaa','sachin'],
       'Age':[32,23,24,44],
     'Address':['Delhi','mumbai','noida','gurugram'],
     'Qualification':['phd','mtech','btech','bba']}
df2=pd.DataFrame(data)
df2

     Name  Age   Address Qualification
0    arun   32     Delhi           phd
1  pankaj   23    mumbai         mtech
2     aaa   24     noida         btech
3  sachin   44  gurugram           bba

In [8]:
print(df2[['Name','Age']])

     Name  Age
0    arun   32
1  pankaj   23
2     aaa   24
3  sachin   44

In [9]:
df2['marks']=[45,67,23,32]

In [10]:
df2

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           phd     45
1  pankaj   23    mumbai         mtech     67
2     aaa   24     noida         btech     23
3  sachin   44  gurugram           bba     32

In [11]:
df2.drop('Age',axis=1)

     Name   Address Qualification  marks
0    arun     Delhi           phd     45
1  pankaj    mumbai         mtech     67
2     aaa     noida         btech     23
3  sachin  gurugram           bba     32

In [12]:
df2.drop(2,axis=0)

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           phd     45
1  pankaj   23    mumbai         mtech     67
3  sachin   44  gurugram           bba     32

In [13]:
df2

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           phd     45
1  pankaj   23    mumbai         mtech     67
2     aaa   24     noida         btech     23
3  sachin   44  gurugram           bba     32

In [14]:
df2.drop(2,axis=0,inplace=True)

In [15]:
df2

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           phd     45
1  pankaj   23    mumbai         mtech     67
3  sachin   44  gurugram           bba     32

In [16]:
newdf2=df2.drop('Age',axis=1)
newdf2

     Name   Address Qualification  marks
0    arun     Delhi           phd     45
1  pankaj    mumbai         mtech     67
3  sachin  gurugram           bba     32

In [17]:
newdf2

     Name   Address Qualification  marks
0    arun     Delhi           phd     45
1  pankaj    mumbai         mtech     67
3  sachin  gurugram           bba     32

In [18]:
df2

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           phd     45
1  pankaj   23    mumbai         mtech     67
3  sachin   44  gurugram           bba     32

In [19]:
df2.columns

Index(['Name', 'Age', 'Address', 'Qualification', 'marks'], dtype='object')

In [20]:
type(df2['Name'])

pandas.core.series.Series

In [21]:
df2

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           phd     45
1  pankaj   23    mumbai         mtech     67
3  sachin   44  gurugram           bba     32

In [23]:
import pandas as pd
df3=pd.read_csv("Automobile_data.csv")

In [24]:
df3

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...,...
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [25]:
df3.columns

Index(['index', 'company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')

In [26]:
df2

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           phd     45
1  pankaj   23    mumbai         mtech     67
3  sachin   44  gurugram           bba     32

In [27]:
df2['marks'].max()

67

In [28]:
df2['marks'].min()

32

In [29]:
df2[df2.marks>50]

     Name  Age Address Qualification  marks
1  pankaj   23  mumbai         mtech     67

In [30]:
df2

     Name  Age   Address Qualification  marks
0    arun   32     Delhi           phd     45
1  pankaj   23    mumbai         mtech     67
3  sachin   44  gurugram           bba     32

In [33]:
df2['Name'][df2.marks==df2['marks'].min()]

3    sachin
Name: Name, dtype: object

In [34]:
df2.index

Int64Index([0, 1, 3], dtype='int64')

In [35]:
df2.describe()

             Age      marks
count   3.000000   3.000000
mean   33.000000  48.000000
std    10.535654  17.691806
min    23.000000  32.000000
25%    27.500000  38.500000
50%    32.000000  45.000000
75%    38.000000  56.000000
max    44.000000  67.000000

In [36]:
df2.index

Int64Index([0, 1, 3], dtype='int64')

In [37]:
ndf2=df2.set_index('Name')

In [38]:
ndf2

        Age   Address Qualification  marks
Name
arun     32     Delhi           phd     45
pankaj   23    mumbai         mtech     67
sachin   44  gurugram           bba     32

In [39]:
ndf2.index

Index(['arun', 'pankaj', 'sachin'], dtype='object', name='Name')

In [40]:
df2.isnull()

    Name    Age  Address  Qualification  marks
0  False  False    False          False  False
1  False  False    False          False  False
3  False  False    False          False  False

In [41]:
df2.notnull()

   Name   Age  Address  Qualification  marks
0  True  True     True           True   True
1  True  True     True           True   True
3  True  True     True           True   True

In [42]:
import pandas as pd
import numpy as np
dict={'fist':[12,13,np.nan,23],
      'second':[5,6,8,7],
      'third':[34,np.nan,43,89]}
    
df=pd.DataFrame(dict)
print(df)

   fist  second  third
0  12.0       5   34.0
1  13.0       6    NaN
2   NaN       8   43.0
3  23.0       7   89.0

In [43]:
df.fillna(0)

   fist  second  third
0  12.0       5   34.0
1  13.0       6    0.0
2   0.0       8   43.0
3  23.0       7   89.0

In [44]:
df

   fist  second  third
0  12.0       5   34.0
1  13.0       6    NaN
2   NaN       8   43.0
3  23.0       7   89.0

In [45]:
df.dropna()

   fist  second  third
0  12.0       5   34.0
3  23.0       7   89.0

In [46]:
df4=pd.read_csv("C:\\Users\\ambuj\\OneDrive\\Desktop\\datan.csv")

In [47]:
df4

     Name  Roll Branch
0     aaa   111    cse
1     bbb    22     it
2      cc    12    ece
3    arun  1212     it
4  pankaj   112    eee

In [1]:
import pandas as pd
df=pd.read_csv("data.csv")

In [2]:
df

  Name   Roll Branch
0  aaa  111.0    cse
1   bb   22.0    NaN
2   cc    NaN    NaN
3  ttt   11.0    cse
4  kkk  333.0     it

In [3]:
df.dropna()

  Name   Roll Branch
0  aaa  111.0    cse
3  ttt   11.0    cse
4  kkk  333.0     it

In [5]:
import numpy as np
label=['a','b','c']
list=[12,14,15]
arr=np.array([34,56,45])
dict={'a':44,'b':66,'c':90}

In [6]:
dict

{'a': 44, 'b': 66, 'c': 90}

In [8]:
pd.Series(data=list)

0    12
1    14
2    15
dtype: int64

In [9]:
pd.Series(data=list,index=label)

a    12
b    14
c    15
dtype: int64

In [10]:
pd.Series(arr)

0    34
1    56
2    45
dtype: int32

In [11]:

pd.Series(arr,label)

a    34
b    56
c    45
dtype: int32

In [12]:
pd.Series(dict)

a    44
b    66
c    90
dtype: int64

In [13]:
sport=pd.Series([23,67,89],index=['cricket','chess','football'])

In [14]:
sport

cricket     23
chess       67
football    89
dtype: int64

In [15]:
sport['chess']

67

In [16]:
data={'Name':['arun','pankaj','arun','sachin'],
       'Age':[32,23,24,44],
     'Address':['Delhi','mumbai','noida','gurugram'],
     'Qualification':['phd','mtech','btech','bba']}
df2=pd.DataFrame(data)
df2

     Name  Age   Address Qualification
0    arun   32     Delhi           phd
1  pankaj   23    mumbai         mtech
2    arun   24     noida         btech
3  sachin   44  gurugram           bba

In [17]:
import pandas as pd
df=pd.read_csv("data.csv")

In [18]:
df

       city    fitem  price
0     delhi    sweet   1000
1    mumbai     vada    100
2     noida  parathe    200
3  gurugram   fruits   5000
4     delhi    chair   2000
5    mumbai     pani    200
6     noida    sweet    300
7  gurugram  flowers   4000

In [20]:
ndf=df.groupby("city")

In [21]:
ndf

In [22]:
print(ndf)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000025A20AF8D60>

In [23]:
ndf['city']

In [24]:
for city,data in ndf:
    print(city)

delhi
gurugram
mumbai
noida

In [25]:
ndf.get_group('delhi')

    city  fitem  price
0  delhi  sweet   1000
4  delhi  chair   2000

In [26]:
ndf.get_group('noida')

    city    fitem  price
2  noida  parathe    200
6  noida    sweet    300

In [27]:
ndf.max()

           fitem  price
city
delhi      sweet   2000
gurugram  fruits   5000
mumbai      vada    200
noida      sweet    300

In [28]:
ndf.min()

            fitem  price
city
delhi       chair   1000
gurugram  flowers   4000
mumbai       pani    100
noida     parathe    200

In [29]:
df

       city    fitem  price
0     delhi    sweet   1000
1    mumbai     vada    100
2     noida  parathe    200
3  gurugram   fruits   5000
4     delhi    chair   2000
5    mumbai     pani    200
6     noida    sweet    300
7  gurugram  flowers   4000

In [30]:
import pandas as pd
df=pd.read_csv("data.csv")

In [31]:
df

        city    fitem  price
0      delhi    sweet   5000
1     mumbai     vada     12
2      noida  parathe    200
3   gurugram   fruits   5000
4      delhi    chair   2000
5     mumbai     pani    200
6      noida    sweet    300
7   gurugram  flowers   5000
8      delhi    sweet     13
9     mumbai     vada    100
10     noida  parathe    200
11  gurugram   fruits     14
12     delhi    chair   2000
13    mumbai     pani    200
14     noida    sweet    122
15  gurugram  flowers   1414

In [32]:
ndf2=df.groupby('city')

In [33]:
ndf2

In [34]:
ndf2.get_group('delhi')

     city  fitem  price
0   delhi  sweet   5000
4   delhi  chair   2000
8   delhi  sweet     13
12  delhi  chair   2000

In [36]:
ndf2.mean()

            price
city
delhi     2253.25
gurugram  2857.00
mumbai     128.00
noida      205.50

In [37]:
ndf2.describe()

         price
         count     mean          std    min      25%     50%     75%     max
city
delhi      4.0  2253.25  2056.828201   13.0  1503.25  2000.0  2750.0  5000.0
gurugram   4.0  2857.00  2539.671632   14.0  1064.00  3207.0  5000.0  5000.0
mumbai     4.0   128.00    90.568574   12.0    78.00   150.0   200.0   200.0
noida      4.0   205.50    72.945185  122.0   180.50   200.0   225.0   300.0

In [38]:
ndf2.size()

city
delhi       4
gurugram    4
mumbai      4
noida       4
dtype: int64

In [39]:
import pandas as pd

In [40]:
delhi=pd.Dataframe({'place':["rohini","cp","dc"],
                   'pl':[400,500,600],
                   'T':[34,35,36]})
delhi

AttributeError: module 'pandas' has no attribute 'Dataframe'

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("data.csv")

In [3]:
df

        city    fitem  price   month
0      delhi    sweet   5000  Aug-17
1     mumbai     vada     12  Sep-17
2      noida  parathe    200  Oct-17
3   gurugram   fruits   5000  Nov-17
4      delhi    chair   2000  Dec-17
5     mumbai     pani    200  Jan-18
6      noida    sweet    300  Feb-18
7   gurugram  flowers   5000  Mar-18
8      delhi  flowers     13  Apr-18
9     mumbai     vada    100  May-18
10     noida  parathe    200  Jun-18
11  gurugram   fruits     14  Jul-18
12     delhi    chair   2000  Aug-18
13    mumbai     pani    200  Sep-18
14     noida    sweet    122  Oct-18
15  gurugram  flowers   1414  Nov-18

In [4]:
ndf=df.groupby("city")

In [5]:
ndf

In [6]:
ndf.get_group('delhi')

     city    fitem  price   month
0   delhi    sweet   5000  Aug-17
4   delhi    chair   2000  Dec-17
8   delhi  flowers     13  Apr-18
12  delhi    chair   2000  Aug-18

In [7]:
ndf.get_group('noida')

     city    fitem  price   month
2   noida  parathe    200  Oct-17
6   noida    sweet    300  Feb-18
10  noida  parathe    200  Jun-18
14  noida    sweet    122  Oct-18

In [9]:
for df1 in ndf:
    print(df1)

('delhi',      city    fitem  price   month
0   delhi    sweet   5000  Aug-17
4   delhi    chair   2000  Dec-17
8   delhi  flowers     13  Apr-18
12  delhi    chair   2000  Aug-18)
('gurugram',         city    fitem  price   month
3   gurugram   fruits   5000  Nov-17
7   gurugram  flowers   5000  Mar-18
11  gurugram   fruits     14  Jul-18
15  gurugram  flowers   1414  Nov-18)
('mumbai',       city fitem  price   month
1   mumbai  vada     12  Sep-17
5   mumbai  pani    200  Jan-18
9   mumbai  vada    100  May-18
13  mumbai  pani    200  Sep-18)
('noida',      city    fitem  price   month
2   noida  parathe    200  Oct-17
6   noida    sweet    300  Feb-18
10  noida  parathe    200  Jun-18
14  noida    sweet    122  Oct-18)

In [10]:
for city,df1 in ndf:
    print(city)
    print(df1)

delhi
     city    fitem  price   month
0   delhi    sweet   5000  Aug-17
4   delhi    chair   2000  Dec-17
8   delhi  flowers     13  Apr-18
12  delhi    chair   2000  Aug-18
gurugram
        city    fitem  price   month
3   gurugram   fruits   5000  Nov-17
7   gurugram  flowers   5000  Mar-18
11  gurugram   fruits     14  Jul-18
15  gurugram  flowers   1414  Nov-18
mumbai
      city fitem  price   month
1   mumbai  vada     12  Sep-17
5   mumbai  pani    200  Jan-18
9   mumbai  vada    100  May-18
13  mumbai  pani    200  Sep-18
noida
     city    fitem  price   month
2   noida  parathe    200  Oct-17
6   noida    sweet    300  Feb-18
10  noida  parathe    200  Jun-18
14  noida    sweet    122  Oct-18

In [11]:
ndf.get_group('noida')

     city    fitem  price   month
2   noida  parathe    200  Oct-17
6   noida    sweet    300  Feb-18
10  noida  parathe    200  Jun-18
14  noida    sweet    122  Oct-18

In [12]:
ndf.min()

            fitem  price   month
city
delhi       chair     13  Apr-18
gurugram  flowers     14  Jul-18
mumbai       pani     12  Jan-18
noida     parathe    122  Feb-18

In [13]:
ndf.max()

           fitem  price   month
city
delhi      sweet   5000  Dec-17
gurugram  fruits   5000  Nov-18
mumbai      vada    200  Sep-18
noida      sweet    300  Oct-18

In [14]:
ndf.mean()

            price
city
delhi     2253.25
gurugram  2857.00
mumbai     128.00
noida      205.50

In [15]:
ndf.describe()

         price
         count     mean          std    min      25%     50%     75%     max
city
delhi      4.0  2253.25  2056.828201   13.0  1503.25  2000.0  2750.0  5000.0
gurugram   4.0  2857.00  2539.671632   14.0  1064.00  3207.0  5000.0  5000.0
mumbai     4.0   128.00    90.568574   12.0    78.00   150.0   200.0   200.0
noida      4.0   205.50    72.945185  122.0   180.50   200.0   225.0   300.0

In [16]:
k=df['city']=='delhi'
df.loc[k]

     city    fitem  price   month
0   delhi    sweet   5000  Aug-17
4   delhi    chair   2000  Dec-17
8   delhi  flowers     13  Apr-18
12  delhi    chair   2000  Aug-18

In [17]:
type(k)

pandas.core.series.Series

In [18]:
df=pd.DataFrame({'name':['arun','pankaj','neha','pooja'],
                'age':[32,30,23,25],
                'weight':[67,65,51,52]})

In [19]:
df

     name  age  weight
0    arun   32      67
1  pankaj   30      65
2    neha   23      51
3   pooja   25      52

In [20]:
df1=pd.DataFrame({'name':['arun','pankaj','neha','pooja'],
                'marks':[32,30,23,25]
                })

In [21]:
df1

     name  marks
0    arun     32
1  pankaj     30
2    neha     23
3   pooja     25

In [22]:
ndf=pd.concat([df,df1])

In [23]:
ndf

     name   age  weight  marks
0    arun  32.0    67.0    NaN
1  pankaj  30.0    65.0    NaN
2    neha  23.0    51.0    NaN
3   pooja  25.0    52.0    NaN
0    arun   NaN     NaN   32.0
1  pankaj   NaN     NaN   30.0
2    neha   NaN     NaN   23.0
3   pooja   NaN     NaN   25.0

In [24]:
ndf=pd.concat([df,df1],ignore_index=True)

In [25]:
ndf

     name   age  weight  marks
0    arun  32.0    67.0    NaN
1  pankaj  30.0    65.0    NaN
2    neha  23.0    51.0    NaN
3   pooja  25.0    52.0    NaN
4    arun   NaN     NaN   32.0
5  pankaj   NaN     NaN   30.0
6    neha   NaN     NaN   23.0
7   pooja   NaN     NaN   25.0

In [26]:
ndf2=pd.concat([df,df1],keys=['x','y'])

In [27]:
ndf2

       name   age  weight  marks
x 0    arun  32.0    67.0    NaN
  1  pankaj  30.0    65.0    NaN
  2    neha  23.0    51.0    NaN
  3   pooja  25.0    52.0    NaN
y 0    arun   NaN     NaN   32.0
  1  pankaj   NaN     NaN   30.0
  2    neha   NaN     NaN   23.0
  3   pooja   NaN     NaN   25.0

In [28]:
ndf2.loc['x']

     name   age  weight  marks
0    arun  32.0    67.0    NaN
1  pankaj  30.0    65.0    NaN
2    neha  23.0    51.0    NaN
3   pooja  25.0    52.0    NaN

In [29]:
import pandas as un

In [30]:
t=un.DataFrame({'city':['delhi','mumbai','bang'],
                'temp':[45,34,32]},index=[0,1,2])

In [31]:
t

     city  temp
0   delhi    45
1  mumbai    34
2    bang    32

In [32]:
p=un.DataFrame({'city':['delhi','bang'],
                'polu':[545,134]},index=[0,2])

In [33]:
p

    city  polu
0  delhi   545
2   bang   134

In [34]:
ndf=un.concat([t,p])

In [35]:
ndf

     city  temp   polu
0   delhi  45.0    NaN
1  mumbai  34.0    NaN
2    bang  32.0    NaN
0   delhi   NaN  545.0
2    bang   NaN  134.0

In [36]:
ndf=un.concat([t,p],axis=1)
ndf

     city  temp   city   polu
0   delhi    45  delhi  545.0
1  mumbai    34    NaN    NaN
2    bang    32   bang  134.0

In [37]:
s1=pd.Series(["sunny","rain","rain"],name='weather')

In [38]:
df2=un.concat([t,s1],axis=1)
df2

     city  temp weather
0   delhi    45   sunny
1  mumbai    34    rain
2    bang    32    rain

In [39]:
t

     city  temp
0   delhi    45
1  mumbai    34
2    bang    32

In [40]:
import pandas as pd

In [49]:
mf1=pd.DataFrame({'city':['delhi','mumbai','hyb'],
                 'polu':[545,132,130]})
mf1

     city  polu
0   delhi   545
1  mumbai   132
2     hyb   130

In [50]:
mf2=pd.DataFrame({'city':['delhi','mumbai','bang'],
                 'temp':[45,32,30]})
mf2

     city  temp
0   delhi    45
1  mumbai    32
2    bang    30

In [51]:
mf3=pd.merge(mf1,mf2,on='city')

In [52]:
mf3

     city  polu  temp
0   delhi   545    45
1  mumbai   132    32

In [53]:
mf3=pd.merge(mf1,mf2,on='city',how='inner')

In [54]:
mf3

     city  polu  temp
0   delhi   545    45
1  mumbai   132    32

In [55]:
mf3=pd.merge(mf1,mf2,on='city',how='outer')

In [56]:
mf3

     city   polu  temp
0   delhi  545.0  45.0
1  mumbai  132.0  32.0
2     hyb  130.0   NaN
3    bang    NaN  30.0

In [57]:
mf3=pd.merge(mf1,mf2,on='city',how='left')

In [58]:
mf3

     city  polu  temp
0   delhi   545  45.0
1  mumbai   132  32.0
2     hyb   130   NaN

In [59]:
mf3=pd.merge(mf1,mf2,on='city',how='right')

In [60]:
mf3

     city   polu  temp
0   delhi  545.0    45
1  mumbai  132.0    32
2    bang    NaN    30